# https://www.acmicpc.net/problem/9095

# n = 1

# t = int(input())
# array = [int(input()) for _ in range(t)]
array = [1, 2, 3, 4, 7, 10]

for n in array:
    dp = [1, 1, 2, 3]

    if n < 4:
        print(sum(dp[:n]))
    else:
        for i in range(4, n):
            dp.append(dp[i - 3] + dp[i - 2] + dp[i - 1])

        print(sum(dp))
# 0 만들기 0
# 0
# 1 만들기 1
# 1
# 2 만들기 2
# 1+1
# 2
# 3 만들기 4
# 1+1+1
# 1+2
# 2+1
# 3
# 4 만들기 7
# 5 만들기 13
# 1+1+1+1+1
# 1+1+1+2
# 1+1+2+1
# 1+2+1+1
# 1+2+2
# 1+1+3
# 1+3+1
# 2+1+1+1
# 2+3
# 2+2+1
# 2+1+2
# 3+1+1
# 3+2


# 0 1 2 4 7 13
#  1 1 2 3 6

###################################

# 처음에 1
# 그다음은 1, 2, 3
# 1: 1
# 2: 1
# 3
# ----
# 2
# 그 다음은 1, 2
# 1: 1
# 2
# ----
# 3
# 그 다음은 1
